# -*- coding: utf-8 -*-
# -----------------------------------
# @CreateTime   : 2020/7/15 21:49
# @Author       : Mark Shawn
# @Email        : shawninjuly@gmail.com
# ------------------------------------

data = [
    "12:17",
    "<",
    "账单",
    "筛选 ▽",
    "分类 、",
    "搜索",
    "支出￥6,907.35",
    "2020-05",
    "收入 ￥ 2.93",
    "口",
    "自如寓（北京）酒店管理有限公司",
    "-164.89",
    "酒店旅行",
    "05-25 16:00",
    "余额宝-笔笔攒-单笔攒入",
    "0.01",
    "投资理财",
    "05-25 16:00",
    "自如寓（北京）酒店管理有限公司 -1,648.90",
    "酒店旅行",
    "05-25 16:00",
    "余额宝-笔笔攒-单笔攒入",
    "0.01",
    "投资理财",
    "05-25 15:59",
    "自如寓 (北京) 酒店管理有限公司 -1,648.66",
    "酒店旅行",
    "05-25 15:59",
    "签到红包-北京思无疆科技有限公司",
    "+0.01",
    "转账充值",
    "05-25 10:04",
    "账单",
    "统计"
  ]

from old.fast_cmd.core import algo_zfb_history

result = [i for i in algo_zfb_history(data)]

print(result)